src/cf/InformationRegisters/МетодыРаспределенияКосвенныхРасходовОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>МетодыРаспределенияКосвенныхРасходовОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БазаРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписокСтатейЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПрямыхЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/БазыРаспределенияКосвенныхРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>БазыРаспределенияКосвенныхРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбъемВыпуска</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлановаяСебестоимость</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальныеЗатраты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выручка</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрямыеЗатраты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтдельныеСтатьиПрямыхЗатрат</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРаспределяется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/МетодыРаспределенияКосвенныхРасходовОрганизаций/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура УправлениеДоступностью()
	Если Не Запись.БазаРаспределения = ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат") Тогда
		Элементы.СписокСтатейЗатрат.Доступность = Ложь;
	Иначе
		Элементы.СписокСтатейЗатрат.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов формы

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="БазаРаспределения" Тогда
		УправлениеДоступностью();
		Если Не Запись.БазаРаспределения = ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат") 
			И Не Запись.СписокСтатейЗатрат = ПредопределенноеЗначение("Справочник.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов.ПустаяСсылка") Тогда
			Если Вопрос("Установлена база распределения: " + Запись.БазаРаспределения + ",
				|для которой указание списка прямых затрат некорректно.
				|Очистить список прямых затрат?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да) <> КодВозвратаДиалога.Нет Тогда
				Запись.СписокСтатейЗатрат = ПредопределенноеЗначение("Справочник.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов.ПустаяСсылка") ;
				Элементы.СписокСтатейЗатрат.Доступность = Ложь;
			Иначе
				Запись.БазаРаспределения = ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат"); 
				Элементы.СписокСтатейЗатрат.Доступность = Истина;
			КонецЕсли;
		КонецЕсли;
		Элементы.СписокСтатейЗатрат.Доступность = (Запись.БазаРаспределения = ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Атрибут_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Элемент.Имя="СчетЗатрат" Тогда
		СтандартнаяОбработка=Ложь;
		СписокСчетов=Новый СписокЗначений;
		СписокСчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы"));
		СписокСчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы"));

		ПараметрыФормы=Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Новый Структура("Ссылка", СписокСчетов));
		ПараметрыФормы.Вставить("РежимВыбора", Истина);

		ОткрытьФорму("ПланСчетов.Хозрасчетный.ФормаСписка", ПараметрыФормы, Элемент, УникальныйИдентификатор);
  КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеДоступностью();
КонецПроцедуры
